#Домашнее Задание 1

#ЗАДАНИЕ-1

#print("Алгоритм управления машины: \n"
#"------------------------------------------------------------------------------------ \n"
# "Подготовка: \n"
#"------------------------------------------------------------------------------------ \n"
#"Сесть, отрегулировать сиденье, зеркала, пристегнуть ремень."
#
#"Проверить, что рычаг коробки передач в нейтрали (или «P» для АКПП). \n"
#"------------------------------------------------------------------------------------ \n"
#
#"Запуск двигателя: \n"
#"------------------------------------------------------------------------------------ \n"
#"Выжать сцепление (для механики), повернуть ключ зажигания."
#
#"Нажать педаль тормоза (для АКПП). \n"
#"------------------------------------------------------------------------------------ \n"
#
#"Начало движения: \n"
#
#
#"Механика: \n"
#"------------- \n"
#"Выжать сцепление, включить 1-ю передачу."
#
#"Плавно отпускать сцепление, одновременно добавляя газ. \n"
#"------------- \n"
#
#
#"Автомат: \n"
#"------------- \n"
#"Перевести рычаг в «D» (Drive), отпустить тормоз — машина начнет движение."
#
#"Переключение передач (для механики): \n"
#
#"Разогнаться → выжать сцепление → переключить передачу → плавно отпустить сцепление. \n"
#"------------------------------------------------------------------------------------ \n"
#
#
#"Торможение и Остановка: \n"
#"------------------------------------------------------------------------------------ \n"
#"Плавно нажать тормоз, выжать сцепление (для механики)."
#
#"Остановившись, поставить нейтраль (или «P» для АКПП), заглушить двигатель."
#
#"Парковка: \n"
#
#"Затянуть ручник, проверить, что автомобиль надежно зафиксирован."
#
#"Важно: \n Все действия выполняются плавно, с постоянным контролем дороги! \n"
#"------------------------------------------------------------------------------------")


#ЗАДАНИЕ-2

#print("Алгоритм покупки велосипедных шин: \n"
#"------------------------------------------------------------------------------------ \n"
# "Как купить велосипедные шины:  \n"
#"------------------------------------------------------------------------------------ \n"
#"Смотри размер на старой покрышке (цифры вроде 26×1.95 или 29×2.2). \n"
#"------------------------------------------------------------------------------------ \n"
#"Выбирай рисунок: \n"
#"------------------------------------------------------------------------------------ \n"
#"Для асфальта — почти гладкие (слики)."
#
#"Для грязи — зубастые."
#
#"Для города — что-то среднее."
#
#"Бери под свой диаметр колеса (26, 27.5, 29 дюймов или 700С). \n"
#
#"Проверь, влезет ли в раму — если берёшь шире старых. \n"
#
#"Купи сразу камеру (смотри, чтобы клапан подходил — Presta или Schrader). \n"
#"------------------------------------------------------------------------------------ \n"
#"Где брать: в любом веломагазине или на Авито (если б/у).")


#ЗАДАНИЕ-3

#print("Алгоритм написания романа: \n"
#"------------------------------------------------------------------------------------ \n"
#"Идея – определите жанр, главную тему и конфликт. \n"
#"------------------------------------------------------------------------------------ \n"
#"Главные герои – создайте протагониста и антагониста с мотивами. \n"
#"------------------------------------------------------------------------------------ \n"
#"Сюжет – продумайте структуру: завязка, развитие, кульминация, развязка. \n"
#"------------------------------------------------------------------------------------ \n"
#"План – набросайте сцены (можно в свободной форме или по главам). \n"
#"------------------------------------------------------------------------------------ \n"
#"Черновик – пишите без редактирования, дайте истории течь. \n"
#"------------------------------------------------------------------------------------ \n"
#"Правки – переработайте слабые места, усилите характеры и логику. \n"
#"------------------------------------------------------------------------------------ \n"
#"Финальная редактура – проверьте стиль, грамматику, ритм. \n"
#"------------------------------------------------------------------------------------ \n"
#"Критика – отдайте бета-ридерам, учтите замечания. \n"
#"------------------------------------------------------------------------------------ \n"
#"Главное: Пишите регулярно, даже по 500 слов в день. Роман – это марафон, а не спринт.")

#ЗАДАНИЕ-4

#print("Алгоритм смены двери: \n"
#"------------------------------------------------------------------------------------ \n"
# "Подготовка: \n"
#"------------------------------------------------------------------------------------ \n"
#"Снимите старую дверь (если есть). \n"
#
#"Проверьте размеры проёма и дверного полотна.\n"
#
#"Подготовьте инструменты: уровень, дрель, шуруповёрт, монтажную пену, клинья.\n"
#"------------------------------------------------------------------------------------ \n"
#"Сборка коробки:\n"
#"------------------------------------------------------------------------------------ \n"
#"Распилите дверную коробку по размеру проёма.\n"
#
#"Соедините элементы коробки под прямым углом (обычно «в шип» или на саморезы).\n"
#"------------------------------------------------------------------------------------ \n"
#"Установка коробки в проём:\n"
#"------------------------------------------------------------------------------------ \n"
#"Вставьте коробку, выровняйте по уровню (вертикаль и горизонталь).\n"
#
#"Закрепите анкерными болтами или монтажными пластинами.\n"
#
#"Зафиксируйте клиньями, чтобы не перекосило.\n"
#"------------------------------------------------------------------------------------ \n"
#"Навешивание полотна:\n"
#"------------------------------------------------------------------------------------ \n"
#"Прикрутите петли к полотну и коробке.\n"
#
#"Проверьте, чтобы дверь открывалась/закрывалась без заеданий.\n"
#"------------------------------------------------------------------------------------ \n"
#"Запенивание и отделка:\n"
#"------------------------------------------------------------------------------------ \n"
#"Заполните зазоры монтажной пеной (не переборщите, чтобы не повело коробку).\n"
#
#"После высыхания срежьте излишки, установите наличники.\n"
#"------------------------------------------------------------------------------------ \n"
#"Установка фурнитуры:\n"
#"------------------------------------------------------------------------------------ \n"
#"Врежьте замок, ручки, при необходимости – доводчик.\n"
#
#"Проверьте работу механизмов.\n"
#"------------------------------------------------------------------------------------ \n"
#"Важно: Если дверь межкомнатная – оставьте зазор 5-10 мм снизу, входную ставьте с порогом.")

#ЗАДАНИЕ-5

#print("Алгоритм управления скейтом: \n"
#"1. Базовая стойка\n"
#"Ноги:\n"
#"------------------------------------------------------------------------------------ \n"
#"Передняя нога — над передними болтами (или чуть дальше), развернута слегка вбок (30–45°).\n"
#
#"Задняя нога — на тейле (хвост доски), перпендикулярно деке.\n"
#
#"Корпус: Слегка согните колени, держите баланс центром тяжести.\n"
#"------------------------------------------------------------------------------------ \n"
#"2. Толчок (разгон)\n"
#"------------------------------------------------------------------------------------ \n"
#"Задней ногой оттолкнитесь от земли, затем поставьте её на деку ближе к задним болтам.\n"
#
#"Передняя нога остаётся на доске, слегка развернута вперёд.\n"
#"------------------------------------------------------------------------------------ \n"
#"3. Повороты\n"
#"------------------------------------------------------------------------------------ \n"
#"Наклоном (карвинг): Перенесите вес на носки или пятки, доска повернётся за счёт изгиба.\n"
#
#"Киктерном: Надавите на тейл, приподнимите передние колёса, развернитесь в воздухе.\n"
#"------------------------------------------------------------------------------------ \n"
#"4. Торможение\n"
#"------------------------------------------------------------------------------------ \n"
#"Плавное: Снимите заднюю ногу, тормозите подошвой об асфальт.\n"
#
#"Резкое: Задней ногой сильно надавите на тейл, чтобы доска встала «торчком».\n"
#"------------------------------------------------------------------------------------ \n"
#"5. Олли (базовый трюк)\n"
#"------------------------------------------------------------------------------------ \n"
#"Задней ногой резко ударьте по тейлу.\n"
#
#"Передней ногой «загребайте» деку вверх, сгибая колени.\n"
#
#"В воздухе выровняйте доску, приземляйтесь на согнутые ноги.\n"
#"------------------------------------------------------------------------------------ \n"
#"6. Безопасность\n"
#"------------------------------------------------------------------------------------ \n"
#"Начинайте на ровной поверхности без препятствий.\n"
#
#"Используйте защиту (шлем, наколенники, перчатки).\n"
#"------------------------------------------------------------------------------------ \n"
#"Главное: Тренируйте баланс и толчок, прежде чем учить трюки. Скейт — это мышечная память, поэтому повторяйте движения до автоматизма.")

#ЗАДАНИЕ-6

#print("Алгоритм мытья посуды:\n"
#"------------------------------------------------------------------------------------ \n"
#"1. Подготовка\n"
#"------------------------------------------------------------------------------------ \n"
#"Уберите остатки еды с тарелок в мусор или компост.\n"
#
#"Рассортируйте посуду:\n"
#
#"Стекло/фарфор → металл → пластик → сильно загрязнённые предметы (сковородки, кастрюли).\n"
#
#"Налейте в раковину тёплую воду (не кипяток, чтобы не испортить покрытие).\n"
#"------------------------------------------------------------------------------------ \n"
#"2. Мытьё\n"
#"------------------------------------------------------------------------------------ \n"
#"Нанесите средство:\n"
#
#"Губкой с моющим гелем или кусковым мылом.\n"
#
#"Для жирной посуды — горячая вода + обезжириватель.\n"
#"------------------------------------------------------------------------------------ \n"
#"Очередность:\n"
#"------------------------------------------------------------------------------------ \n"
#"Сначала слабо загрязнённое (стаканы, вилки), потом жирное (тарелки, сковородки).\n"
#
#"Используйте отдельную губку для тефлона и стекла.\n"
#"------------------------------------------------------------------------------------ \n"
#"Трудные пятна:\n"
#"------------------------------------------------------------------------------------ \n"
#"Засохшую еду — замочите на 5–10 минут.\n"
#
#"Пригоревшую пищу — сода + уксус (оставить на 15 минут).\n"
#"------------------------------------------------------------------------------------ \n"
#"3. Ополаскивание"
#"------------------------------------------------------------------------------------ \n"
#"Промойте каждую вещь под проточной холодной водой (удаляет моющее средство).\n"
#
#"Для блеска стекла — протрите полотенцем сразу после ополаскивания.\n"
#"------------------------------------------------------------------------------------ \n"
#"4. Сушка и уборка\n"
#"------------------------------------------------------------------------------------ \n"
#"Поставьте посуду на сушку (решетку) вверх дном.\n"
#
#"Кастрюли/сковородки вытрите насухо, чтобы не оставалось разводов.\n"
#
#"Протрите раковину и стол от капель.\n"
#"------------------------------------------------------------------------------------ \n"
#"5. Дополнительно\n"
#"------------------------------------------------------------------------------------ \n"
#"Раз в неделю мойте губки/щетки в посудомоечной машине или замачивайте в хлоргексидине.\n"
#
#"Для деревянных досок/ложек — специальное масло после мытья.\n"
#"------------------------------------------------------------------------------------ \n"
#"Важно: Не смешивайте уксус и хлорсодержащие средства (выделяет токсичный газ).")


#Домашнее Задание 2

#ЗАДАНИЕ-1

#one = int(input("Введите первое число: "))
#two= int(input("Введите второе число: "))
#three = int(input("Введите третье число: "))
#
#if(True):
#  result = one + two + three
#  print(result)


#ЗАДАНИЕ-2

#one = int(input("Введите вашу месячную зарплату: "))
#two= int(input("Введите сумму оплаты кредита за месяц: "))
#three = int(input("Введите сумму оплаты комунальных услуг: "))
#
#if(True):
#  result = one - two - three
#  print(result)

#ЗАДАНИЕ-3

#one = int(input("Введите длину первой диагонали ромба:"))
#two = int(input("Введите длину второй диагонали ромба:"))
#
#if(True):
#  result = one * two / 2  
#  print(result)


#ЗАДАНИЕ-4

#print("To be \n or not \n to be")


#ЗАДАНИЕ-5

#print("Life is what happens\n    when\n       "
#"you're busy making other plans\n                                   John Lennon")


#Домашнее Задание 3

#ЗАДАНИЕ-1

#one = input("Введите первое число: ")
#two = input("Введите второе число: ")
#three = input("Введите третье число: ")
#print(one + two + three)


#ЗАДАНИЕ-2

#number = list(input("Введите четырехзначное число: "))
#new = [int(d) for d in number]
#product = 1
#for num in new:
#    product *= num
#print(product)


#ЗАДАНИЕ-3

#meters = float(input('Введите количество метров: '))
#centimeters = meters * 100
#decimeters = meters * 10
#milimeters = meters * 1000
#miles = meters * 0.000621371
#print(centimeters)
#print(decimeters)
#print(milimeters)
#print(miles)


#ЗАДАНИЕ-4

#one = int(input("Введите размер основания: "))
#two = int(input("Введите размер высоты: "))
#print(one*two)


#ЗАДАНИЕ-5

#text = input("Введите число: ")
#newText = text[::-1]
#print(newText)